app/controllers/styles_controller.rb

SELECT "styles".* FROM "styles"
---
    def index
        styles = Style.all

SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        style = Style.find(params[:id])

INSERT INTO "styles" ("properties", "user_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        style = Style.create(style_params)

SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "styles" SET "name" = $1, "updated_at" = $2 WHERE "styles"."id" = $3  [["name", "testagain"], ["updated_at", "2020-08-20 18:29:13.856890"], ["id", 1]]
---
    def update
        style = Style.find(params[:id])
        style.update(style_params)

SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "styles" WHERE "styles"."id" = $1  [["id", 1]]
---
    def destroy
        style = Style.find(params[:id])
        Style.delete(style)