app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "testy mc tester son"], ["password", "schmoopy"], ["created_at", "2020-08-18 18:22:59.824671"], ["updated_at", "2020-08-18 18:22:59.824671"]]
---
    def create
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jake Hyde"], ["LIMIT", 1]]
---
    def searchUser
        user = User.find_by(username: params[:username])